ERP.belugaerp/src/Documents/битПоступлениеДенежныхСредствОтРозничногоПокупателя/битПоступлениеДенежныхСредствОтРозничногоПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битПоступлениеДенежныхСредствОтРозничногоПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_РасчетыСРозничнымиКлиентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВРозницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битПоступлениеДенежныхСредствОтРозничногоПокупателя/Forms/ФормаПодбораДокументаОтгрузки/Module.bsl
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Отбор.Элементы.Очистить();
	
	Если Параметры.Свойство("ОтборСписка") Тогда
		
		Для Каждого Отбор из Параметры.ОтборСписка Цикл
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Отбор.Ключ);
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование  = Истина;
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ПравоеЗначение = Отбор.Значение;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура Выбрать(Команда)
	
	РезультатВыбора = РезультатВыбора();

	ОповеститьОВыборе(РезультатВыбора);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	РезультатВыбора = РезультатВыбора();
		
	ОповеститьОВыборе(РезультатВыбора);
	СтандартнаяОбработка = Ложь;	

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РезультатВыбора()
	
	КонтрагентДоговор = Новый Структура();	
	КонтрагентДоговор.Вставить("Контрагент");
	КонтрагентДоговор.Вставить("Договор");
	КонтрагентДоговор.Вставить("СуммаВРозницу");
	
	РезультатВыбора = Новый Структура(); 	
	РезультатВыбора.Вставить("ДокументОтгрузки", Неопределено);
	РезультатВыбора.Вставить("Сумма", 0);
	РезультатВыбора.Вставить("КонтрагентДоговор", КонтрагентДоговор);
	
	ЗаполнитьЗначенияСвойств(РезультатВыбора, Элементы.Список.ТекущиеДанные);
	ЗаполнитьЗначенияСвойств(РезультатВыбора.КонтрагентДоговор, Элементы.Список.ТекущиеДанные);
	
	Возврат РезультатВыбора;
	
КонецФункции

#КонецОбласти
